import pandas as pd
import numpy as np

data = pd.DataFrame({'name':['A','B','C','D'],'数学':[80,15,90,50],'英語':[80,70,50,65],'国語':[90,60,60,60]})

print(data)

# --------------------------------

e_data = pd.DataFrame({'name': 'E','国語':[30],'数学':[30],'英語':[30]})
print(e_data)

# --------------------------------
data_2 = pd.DataFrame({'name':['A','B','C','D','D'],'国語-数学':['30:20',np.NAN,'90:50','50:30','50:30'],'英語':['80.2','60.5','34,2',0,0]})
print(data_2)

# --------------------------------

data_3 = pd.DataFrame({'name': ['A', 'B', 'C', 'D'],'性別': ['男性', '男性', '女性', '男性'],'経歴': ['学部卒', '修士卒', '学部卒', '博士卒'],'特技': ['ボーリング', '野球', 'サッカー', '野球をやっていた']})
print(data_3)

# --------------------------------

print(type(data))

# --------------------------------

Series = pd.Series([1,3,5])
print(type(Series))